[
  {
    "version": "1.7",
    "changelog": "NOTE: This is an alpha release. Bugs may happen. Remember to take backups.\r\n\r\n    Port to Minecraft 1.14 (raoulvdberge)\r\n    Removed the Reader and Writer, this will return later in an addon mod (raoulvdberge)\r\n    Removed cross dimensional functionality on the Network Transmitter for the moment, this will return later (raoulvdberge)\r\n    Removed covers (raoulvdberge)\r\n    Fixed the Fluid Grid not having a View type setting (raoulvdberge)\r\n    Oredict mode for Patterns has been replaced with \"Exact mode\" (by default on). When exact mode is off, Refined Storage will use equivalent items or fluids from the Minecraft item\/fluid tag system (raoulvdberge)\r\n    Grid filtering with \"$\" now does filtering based on item\/fluid tag name instead of oredict name (raoulvdberge)\r\n    When binding a network item to a network you can now bind to any network block, not only the Controller (raoulvdberge)\r\n",
    "type": "alpha",
    "date": "2019-11-02T12:46:33+00:00",
    "links": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/files\/2820669"
    },
    "downloads": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/download\/2820669"
    }
  },
  {
    "version": "1.7.1",
    "changelog": "    Exact mode for processing patterns no longer exist, you can now define per-slot which item\/fluid tags are allowed to be used by autocrafting, by using CTRL + click on the filter slot in the Pattern Grid (raoulvdberge)\r\n    The Pattern Grid now switches automatically between crafting pattern and processing pattern mode when using JEI transfer (raoulvdberge)\r\n    The Pattern Grid now switches automatically between crafting pattern and processing pattern mode when re-inserting an existing Pattern (raoulvdberge)\r\n    Removed migration code for the development builds that were released on Discord (not on CurseForge). If you used the development builds and never used version 1.7 before, first switch to 1.7, open your world, modify a storage disk, and then upgrade to 1.7.1 (raoulvdberge)\r\n    Grids now do not sort if you interact with it while holding shift (Darkere)\r\n    Fixed Pattern Grid causing world hanging on load (raoulvdberge)\r\n    Fixed External Storage not refreshing when the storage is broken or replaced (raoulvdberge)\r\n    Fixed delay in block update when placing a cable block (raoulvdberge)\r\n    Fixed holder of cable blocks sometimes conflicting with a cable connection while rendering (raoulvdberge)\r\n    Fixed being able to move wireless items in inventory when using a keybinding to open (raoulvdberge)\r\n    Fixed crash when breaking a Grid, Crafting Monitor, Crafter Manager or Portable Grid when another player is still using it (raoulvdberge)",
    "type": "alpha",
    "date": "2019-11-19T21:38:36+00:00",
    "links": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/files\/2829731"
    },
    "downloads": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/download\/2829731"
    }
  },
  {
    "version": "1.7.2",
    "changelog": "Resource packs can now define the font colors that Refined Storage GUIs need to use (raoulvdberge)\r\nPatterns being added or removed from the network are now propagated as well to clients that are watching a Grid (raoulvdberge)\r\nWhen pressing ESCAPE in the search box on the Grid or Crafter Manager, focus on the search bar will be lost first before closing the GUI immediately. Then on the next ESCAPE press, the GUI will be closed (raoulvdberge)\r\nFixed crash when loading a network (raoulvdberge, LezChap)\r\nFixed being able to drain energy from the Refined Storage Controller (raoulvdberge)\r\nFixed the Grid crashing on a item\/fluid update-heavy storage system (raoulvdberge, Darkere, noobanidus)\r\nFixed the Grid displaying the old quantity when shift clicking an entire stack out (raoulvdberge)\r\nFixed crash with the Disk Manipulator and using item\/fluid filters when inserting into the network (raoulvdberge)\r\nFixed the network being able to run off 1 FE\/t (raoulvdberge)",
    "type": "beta",
    "date": "2019-12-29T16:20:26+00:00",
    "links": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/files\/2851365"
    },
    "downloads": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/download\/2851365"
    }
  },
  {
    "version": "1.7.3",
    "changelog": "Fixed severe energy update lag introduced by version 1.7.2 (raoulvdberge)",
    "type": "beta",
    "date": "2019-12-30T12:37:04+00:00",
    "links": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/files\/2851763"
    },
    "downloads": {
      "curseforge": "https:\/\/www.curseforge.com\/minecraft\/mc-mods\/refined-storage\/download\/2851763"
    }
  }
]